{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {"class_name": "Dense", "config": {"units": 32, "activation": "relu", "input_shape": [25]}},
          {"class_name": "Dense", "config": {"units": 25, "activation": "sigmoid"}}
        ]
      }
    }
  },
  "weightsManifest": [{
    "paths": ["group1-shard1of1.bin"],
    "weights": [
      {"name": "dense/kernel", "shape": [25, 32], "dtype": "float32"},
      {"name": "dense/bias", "shape": [32], "dtype": "float32"},
      {"name": "dense_1/kernel", "shape": [32, 25], "dtype": "float32"},
      {"name": "dense_1/bias", "shape": [25], "dtype": "float32"}
    ]
  }]
}